cases/advection/2Dshear/lent-hex-shear2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./constant/caseSetup";

convertToMeters 1.00;

vertices
(
    (0   0   0)
    (1   0   0)
    (1   1   0)
    (0   1   0)
    (0   0   0.01)
    (1   0   0.01)
    (1   1   0.01)
    (0   1   0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($N $N 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch left
    (
        (0 4 7 3)
    )
    patch right
    (
        (2 6 5 1)
    )
    patch front
    (
        (1 5 4 0)
    )
    patch back
    (
        (3 7 6 2)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
